src/Catalogs/onyx_СессииЧата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>onyx_СессииЧата</Name>
			<Comment>Хранение метаданных сессий чата из Onyx</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.onyx_Агенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнееСообщениеID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДоступа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.onyx_СтатусДоступаСессии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/onyx_СессииЧата/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Публичный программный интерфейс

// Находит сессию по идентификатору Onyx.
// Параметры:
//   Идентификатор - УникальныйИдентификатор - идентификатор сессии Onyx.
// Возвращаемое значение:
//   СправочникСсылка.onyx_СессииЧата - найденная сессия или Неопределено.
Функция НайтиПоИдентификатору(Идентификатор) Экспорт
	
	Если Не onyx_ВалидацияДанных.ВалидироватьИдентификаторСессии(Идентификатор) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		UUIDСессии = Новый УникальныйИдентификатор(Идентификатор);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Справочники.onyx_СессииЧата.НайтиПоРеквизиту("Идентификатор", UUIDСессии);
	
КонецФункции

// Возвращает идентификатор сессии Onyx по ссылке.
// Параметры:
//   СсылкаНаСессию - СправочникСсылка.onyx_СессииЧата - ссылка на сессию.
// Возвращаемое значение:
//   УникальныйИдентификатор - идентификатор сессии Onyx или Неопределено.
Функция ПолучитьИдентификатор(СсылкаНаСессию) Экспорт
	
	Если Не ЗначениеЗаполнено(СсылкаНаСессию) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Сессии.Идентификатор КАК Идентификатор
		|ИЗ
		|	Справочник.onyx_СессииЧата КАК Сессии
		|ГДЕ
		|	Сессии.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСессию);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Идентификатор;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает идентификатор агента (владельца) сессии по ссылке.
// Параметры:
//   СсылкаНаСессию - СправочникСсылка.onyx_СессииЧата - ссылка на сессию.
// Возвращаемое значение:
//   Число - идентификатор агента Onyx или Неопределено.
Функция ПолучитьИдентификаторАгента(СсылкаНаСессию) Экспорт
	
	Если Не ЗначениеЗаполнено(СсылкаНаСессию) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Сессии.Владелец.Идентификатор КАК ИдентификаторАгента
		|ИЗ
		|	Справочник.onyx_СессииЧата КАК Сессии
		|ГДЕ
		|	Сессии.Ссылка = &Ссылка
		|	И Сессии.Владелец.Идентификатор <> ЗНАЧЕНИЕ(Число, 0)";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСессию);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ИдентификаторАгента;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает пользователя сессии по ссылке.
// Параметры:
//   СсылкаНаСессию - СправочникСсылка.onyx_СессииЧата - ссылка на сессию.
// Возвращаемое значение:
//   UUID - идентификатор пользователя или Неопределено.
Функция ПолучитьПользователя(СсылкаНаСессию) Экспорт
	
	Если Не ЗначениеЗаполнено(СсылкаНаСессию) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Сессии.Пользователь КАК Пользователь
		|ИЗ
		|	Справочник.onyx_СессииЧата КАК Сессии
		|ГДЕ
		|	Сессии.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСессию);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Пользователь;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Проверяет доступ пользователя к сессии.
// Параметры:
//   СсылкаНаСессию - СправочникСсылка.onyx_СессииЧата - ссылка на сессию.
//   Пользователь - UUID - идентификатор пользователя для проверки (необязательный).
//                   Если не указан, используется текущий пользователь.
// Возвращаемое значение:
//   Булево - Истина, если доступ разрешен, иначе Ложь.
Функция ПроверитьДоступ(СсылкаНаСессию, Пользователь = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(СсылкаНаСессию) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = ПолучитьКлючПользователя();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПользовательСессии = ПолучитьПользователя(СсылкаНаСессию);
	
	Если Не ЗначениеЗаполнено(ПользовательСессии) Тогда
		Возврат Истина; // Если пользователь не указан, доступ разрешен
	КонецЕсли;
	
	Возврат ПользовательСессии = Пользователь;
	
КонецФункции

// Возвращает массив ссылок на сессии по фильтрам.
// Параметры:
//   Пользователь - UUID - идентификатор пользователя (необязательный).
//   Владелец - СправочникСсылка.onyx_Агенты - фильтр по владельцу (необязательный).
//   Активные - Булево - при Истина возвращает только активные сессии (необязательный).
// Возвращаемое значение:
//   Массив - ссылки на элементы справочника `onyx_СессииЧата`.
Функция НайтиПоПользователю(Пользователь = Неопределено, Владелец = Неопределено, Активные = Истина) Экспорт
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = ПолучитьКлючПользователя();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Сессии.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.onyx_СессииЧата КАК Сессии
	|ГДЕ
	|	Сессии.Пользователь = &Пользователь";
	
	Если ЗначениеЗаполнено(Владелец) Тогда
		ТекстЗапроса = ТекстЗапроса + "
	|	И Сессии.Владелец = &Владелец";
	КонецЕсли;
	
	Если Активные Тогда
		ТекстЗапроса = ТекстЗапроса + "
	|	И Сессии.Активна";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|УПОРЯДОЧИТЬ ПО
	|	Сессии.ДатаПоследнегоСообщения УБЫВ";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Если ЗначениеЗаполнено(Владелец) Тогда
		Запрос.УстановитьПараметр("Владелец", Владелец);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает метаданные сессии по ссылке.
// Параметры:
//   СсылкаНаСессию - СправочникСсылка.onyx_СессииЧата - ссылка на сессию.
// Возвращаемое значение:
//   Структура - метаданные сессии с полями:
//     Наименование - Строка
//     Описание - Строка (всегда пустая строка, поле отсутствует в справочнике)
//     Пользователь - UUID
//     ДатаПоследнегоСообщения - Дата
//     ДатаСоздания - Дата
//     Активна - Булево
//     ДатаСинхронизации - Дата
Функция ПолучитьМетаданные(СсылкаНаСессию) Экспорт
	
	Результат = Новый Структура("Наименование,Описание,Пользователь,ДатаПоследнегоСообщения,ДатаСоздания,Активна,ДатаСинхронизации",
		"", "", "", Неопределено, Неопределено, Ложь, Неопределено);
	
	Если Не ЗначениеЗаполнено(СсылкаНаСессию) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Сессии.Наименование КАК Наименование,
		|	Сессии.Пользователь КАК Пользователь,
		|	Сессии.ДатаПоследнегоСообщения КАК ДатаПоследнегоСообщения,
		|	Сессии.ДатаСоздания КАК ДатаСоздания,
		|	Сессии.Активна КАК Активна,
		|	Сессии.ДатаСинхронизации КАК ДатаСинхронизации
		|ИЗ
		|	Справочник.onyx_СессииЧата КАК Сессии
		|ГДЕ
		|	Сессии.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСессию);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат.Наименование = Строка(Выборка.Наименование);
		Результат.Описание = ""; // Поле отсутствует в справочнике
		Результат.Пользователь = Выборка.Пользователь;
		Результат.ДатаПоследнегоСообщения = Выборка.ДатаПоследнегоСообщения;
		Результат.ДатаСоздания = Выборка.ДатаСоздания;
		Результат.Активна = Выборка.Активна;
		Результат.ДатаСинхронизации = Выборка.ДатаСинхронизации;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Частные процедуры и функции

// Возвращает уникальный идентификатор текущего пользователя.
// Возвращаемое значение:
//   UUID - уникальный идентификатор пользователя или Неопределено.
Функция ПолучитьКлючПользователя()
	
	Пользователь = Неопределено;
	Если Метаданные.ПараметрыСеанса.Найти("ТекущийПользователь") <> Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	ТипПользователя = ТипЗнч(Пользователь);
	
	Если ТипПользователя = Тип("СправочникСсылка.Пользователи")
		ИЛИ ТипПользователя = Тип("Пользователь") Тогда
		Возврат Пользователь.УникальныйИдентификатор();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
